### Terragrunt Plan :memo:

```text
time=2024-07-14T13:40:47Z level=info msg=The stack at terraform will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/homelab/homelab/terraform/aliyun


Acquiring state lock. This may take a few moments...
module.nixos_hgh2.data.external.build: Reading...
module.nixos_hgh1.data.external.build: Reading...
module.nixos_hgh2.data.external.build: Read complete after 10s [id=-]
module.nixos_hgh1.data.external.build: Read complete after 10s [id=-]
module.nixos_hgh2.data.external.keyscan: Reading...
module.nixos_hgh1.data.external.keyscan: Reading...
module.nixos_hgh1.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_hgh2.data.external.keyscan: Read complete after 4s [id=-]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # local_file.sops_config must be replaced
-/+ resource "local_file" "sops_config" {
      ~ content              = <<-EOT # forces replacement
            keys:
              - &user_sun 8CC5C91F72DB57DA20BD848C6523836CF4992251
              - &github_action
                arn: arn:aws:kms:ap-southeast-1:137927498482:alias/sops-key
              - &host_hgh1 age1w9jxjempv57weclcf9pgc2j5qs0f89uup2cmpws7y56g5jfrldqqqwwwf9
              - &host_hgh2 age1lawg2fw8nfmh4nuz9k76znqu96f786e3uk6hdccxkrae06qj9ugspyt5cg
            creation_rules:
          -   - path_regex: ^secrets/all_hosts\.yaml$
          +   - path_regex: ^secrets/all-hosts\.yaml$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
                    age:
                      - *host_hgh1
                      - *host_hgh2
              - path_regex: ^secrets/hosts/hgh1\.yaml$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
                    age:
                      - *host_hgh1
              - path_regex: ^secrets/hosts/hgh2\.yaml$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
                    age:
                      - *host_hgh2
              - path_regex: ^secrets/terraform/tofu-encryption\.json$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
              - path_regex: ^.data/tfplans.tar.gz
                key_groups:
                  - kms:
                      - *github_action
        EOT
      ~ content_base64sha256 = "HXc47wj0zR3f6tZaULLDDsp/Fw3MyXmyX8CdQrzSfsQ=" -> (known after apply)
      ~ content_base64sha512 = "JFkXj/eTGExf9E2kNnnWLRT+jylKkASQPLGzW1xPvq5EaN0FPV3wkaPfphbTPhZusxdPuCeZAfd2LG2ruoQ4mg==" -> (known after apply)
      ~ content_md5          = "7c29a13a031f101f951c7f3eb42a0ae5" -> (known after apply)
      ~ content_sha1         = "a4e98da771b2f0a8d3cb8a7fff20b242e1e9e949" -> (known after apply)
      ~ content_sha256       = "1d7738ef08f4cd1ddfead65a50b2c30eca7f170dccc979b25fc09d42bcd27ec4" -> (known after apply)
      ~ content_sha512       = "2459178ff793184c5ff44da43679d62d14fe8f294a9004903cb1b35b5c4fbeae4468dd053d5df091a3dfa616d33e166eb3174fb8279901f7762c6dabba84389a" -> (known after apply)
      ~ id                   = "a4e98da771b2f0a8d3cb8a7fff20b242e1e9e949" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.nixos_hgh1.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "8424479955803794241" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/8nzrkxfgagf1rx5yz5ivhhk4rxxkq3s0-nixos-system-nixos-24.11.20240709.feb2849" -> "/nix/store/59p76vg562akqficiym9cxrzn3y16421-nixos-system-hgh1-24.11.20240709.feb2849"
            # (1 unchanged element hidden)
        }
    }

  # module.nixos_hgh2.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "527149531969688748" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/8nzrkxfgagf1rx5yz5ivhhk4rxxkq3s0-nixos-system-nixos-24.11.20240709.feb2849" -> "/nix/store/x6syg379z6lwr40bvpll5zz8qmlamlr4-nixos-system-hgh2-24.11.20240709.feb2849"
            # (1 unchanged element hidden)
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.
Releasing state lock. This may take a few moments...
```

**Status**: out of sync :warning: